import Image from 'next/image'
import React from 'react'

function Comment() {
  return (
    <div className='mx-auto w-[656px] h-[230px] bg-white rounded-[24px] p-[24px] flex flex-col flex-wrap gap-[9px]'>
      <div className='flex justify-end'>
        <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M8.33317 6.66665C8.33317 8.238 8.33317 9.02365 7.84501 9.51181C7.35686 9.99998 6.57119 9.99998 4.99984 9.99998C3.42849 9.99998 2.64281 9.99998 2.15466 9.51181C1.6665 9.02365 1.6665 8.238 1.6665 6.66665C1.6665 5.0953 1.6665 4.30962 2.15466 3.82147C2.64281 3.33331 3.42849 3.33331 4.99984 3.33331C6.57119 3.33331 7.35686 3.33331 7.84501 3.82147C8.33317 4.30962 8.33317 5.0953 8.33317 6.66665Z" stroke="#1C1C1C" strokeWidth="1.5" />
          <path d="M8.3335 5.83331V9.5684C8.3335 12.8789 6.23707 15.6864 3.3335 16.6666" stroke="#1C1C1C" strokeWidth="1.5" strokeLinecap="round" />
          <path d="M18.3332 6.66665C18.3332 8.238 18.3332 9.02365 17.845 9.51181C17.3568 9.99998 16.5712 9.99998 14.9998 9.99998C13.4285 9.99998 12.6428 9.99998 12.1547 9.51181C11.6665 9.02365 11.6665 8.238 11.6665 6.66665C11.6665 5.0953 11.6665 4.30962 12.1547 3.82147C12.6428 3.33331 13.4285 3.33331 14.9998 3.33331C16.5712 3.33331 17.3568 3.33331 17.845 3.82147C18.3332 4.30962 18.3332 5.0953 18.3332 6.66665Z" stroke="#1C1C1C" strokeWidth="1.5" />
          <path d="M18.3335 5.83331V9.5684C18.3335 12.8789 16.2371 15.6864 13.3335 16.6666" stroke="#1C1C1C" strokeWidth="1.5" strokeLinecap="round" />
        </svg>
      </div>
      <p dir='rtl' className='text-right text-[16px] font-[600]'>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد ...  </p>
      <div className='flex justify-between'>
        <div className='flex w-[140px] justify-between'>
          <svg className='my-auto' width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
            <circle cx="16" cy="16" r="15.5" fill="white" stroke="#EAEAEA" />
            <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M16 -6.99382e-07C19.2233 -8.40278e-07 22.3715 0.973557 25.0321 2.79315C27.6927 4.61273 29.7417 7.1935 30.9107 10.1974C32.0797 13.2013 32.3142 16.4882 31.5834 19.6276C30.8526 22.7669 29.1906 25.6124 26.8152 27.7912C24.4397 29.97 21.4616 31.3805 18.2709 31.838C15.0802 32.2955 11.8258 31.7786 8.93381 30.3551C6.04187 28.9316 3.64731 26.6677 2.06381 23.8602C0.480315 21.0526 -0.218279 17.8323 0.0595404 14.621L3.38958 14.909C3.1698 17.4495 3.72245 19.9971 4.97515 22.2182C6.22785 24.4392 8.12217 26.2301 10.41 27.3562C12.6978 28.4824 15.2724 28.8913 17.7965 28.5294C20.3207 28.1675 22.6766 27.0516 24.5558 25.328C26.435 23.6043 27.7498 21.3533 28.3279 18.8697C28.906 16.3862 28.7206 13.7859 27.7958 11.4096C26.871 9.03322 25.2501 6.99159 23.1453 5.55212C21.0405 4.11266 18.55 3.34248 16 3.34248L16 -6.99382e-07Z" fill="#586CFF" />
            </svg>
          </svg>

          <svg className='my-auto cursor-pointer' width="42" height="16" viewBox="0 0 42 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M41 7C41.5523 7 42 7.44772 42 8C42 8.55228 41.5523 9 41 9V7ZM0.292892 8.70711C-0.0976295 8.31658 -0.0976295 7.68342 0.292892 7.29289L6.65685 0.928932C7.04738 0.538408 7.68054 0.538408 8.07107 0.928932C8.46159 1.31946 8.46159 1.95262 8.07107 2.34315L2.41422 8L8.07107 13.6569C8.46159 14.0474 8.46159 14.6805 8.07107 15.0711C7.68054 15.4616 7.04738 15.4616 6.65685 15.0711L0.292892 8.70711ZM41 9H1V7H41V9Z" fill="#C4C4C4" />
          </svg>

          <svg className='my-auto cursor-pointer' width="42" height="16" viewBox="0 0 42 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M1 7C0.447715 7 0 7.44772 0 8C0 8.55228 0.447715 9 1 9V7ZM41.7071 8.70711C42.0976 8.31658 42.0976 7.68342 41.7071 7.29289L35.3431 0.928932C34.9526 0.538408 34.3195 0.538408 33.9289 0.928932C33.5384 1.31946 33.5384 1.95262 33.9289 2.34315L39.5858 8L33.9289 13.6569C33.5384 14.0474 33.5384 14.6805 33.9289 15.0711C34.3195 15.4616 34.9526 15.4616 35.3431 15.0711L41.7071 8.70711ZM1 9H41V7H1V9Z" fill="black" />
          </svg>

        </div>
        <div className='flex gap-x-[8px]'>
          <div className='flex flex-col flex-wrap'>
            <p className='font-[600] text-right text-[16px] text-[#232323]'>پارسا آقایی</p>
            <p dir='rtl' className='font-[500] text-right text-[14px] font-yekannum text-[#5F5F5F]'>12 مرداد 1403</p>
          </div>
          <Image src={"https://static.vecteezy.com/system/resources/previews/026/625/600/non_2x/person-icon-symbol-design-illustration-vector.jpg"} alt='profile' width={48} height={48} className='rounded-[100px] border-black border-[1px]' />
        </div>
      </div>
    </div>
  )
}

export default Comment