export function getProfileHint(completion: number): string {
  if (completion < 30) {
    return "برای اینکه پروفایل شما قابل اعتماد باشد، لطفاً اطلاعات بیشتری وارد کنید.";
  } else if (completion < 50) {
    return "برای جذب کاربران بیشتر، بهتر است پروفایل خود را تکمیل‌تر کنید.";
  } else if (completion < 70) {
    return "برای اینکه بازدید خوبی داشته باشید، پروفایل شما باید حداقل %70 تکمیل شده باشد.";
  } else if (completion < 90) {
    return "عالیه! فقط چند مرحله دیگر تا پروفایل کامل باقی مانده.";
  } else if (completion < 100) {
    return "تقریباً تمام شد! با تکمیل نهایی، اعتماد بیشتری جلب خواهید کرد.";
  } else {
    return "پروفایل شما کامل است. آماده استفاده حداکثری از امکانات هستید!";
  }
}
