import Image from "next/image";
import icon1 from "../../../assets/images/footer/5083a983cba6cfdb03395e9c5f3affccc79f623b.png";
import icon2 from "../../../assets/images/footer/c82fd62437e1e6142434fb2e1fcb4f77a4d849b0.png";
import icon3 from "../../../assets/images/footer/cea34e5ab426cc28c323d8f6355265cccb1e7ec9.png";

export default function Footer() {
  // Contact info data
  const contactInfo = [
    { text: "۰۲۱۲۳۴۵۶۷۸۹ - ۰۹۱۲۳۴۵۶۷۸۹", className: "mb-2" },
    { text: "Delta@gmail.com", className: "mb-4" },
    {
      text: "گیلان، رشت، میدان آزادی، جنب چهار راه علی آباد",
      className: "mb-1",
    },
    { text: "زاهد", className: "" },
  ];

  // Customer services data
  const customerServices = [
    { text: "پرسش های متداول مهمان", className: "mb-2" },
    { text: "پرسش های متداول میزبان", className: "mb-2" },
    { text: "چطور اقامتگاه ثبت کنم؟", className: "mb-2" },
    { text: "حریم شخصی کاربران", className: "" },
  ];

  // How to use data
  const howToUse = [
    { text: "راهنمای رزرو اقامتگاه", className: "mb-2" },
    { text: "شیوه پرداخت", className: "mb-2" },
    { text: "نحو رزرو اقامتگاه", className: "" },
  ];

  return (
    <div className="w-full border-t border-[#000000] my-10 flex flex-col py-10">
      <div className="flex justify-end mb-10">
        <svg
          width="106"
          height="36"
          viewBox="0 0 106 36"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M8.32031 4.17969V30.7812C8.32031 32.0469 8.57812 32.9688 9.09375 33.5469C9.60938 34.125 10.5859 34.5469 12.0234 34.8125L11.8125 35.375C10.0312 35.125 8.625 35 7.59375 35C6.67188 35 5.60156 35.125 4.38281 35.375L4.24219 35.1406C4.55469 34.6875 4.71094 33.8594 4.71094 32.6562V8.02344C4.71094 5.80469 4.45312 4.35156 3.9375 3.66406C3.4375 2.96094 2.32031 2.60938 0.585938 2.60938L0.492188 1.92969C4.83594 1.28906 8.32812 0.96875 10.9688 0.96875C12.7812 0.96875 14.3828 1.10156 15.7734 1.36719C17.1797 1.63281 18.4453 2.07812 19.5703 2.70312C20.6953 3.3125 21.5547 4.16406 22.1484 5.25781C22.7578 6.35156 23.0625 7.67188 23.0625 9.21875C23.0625 10.9219 22.5078 12.4766 21.3984 13.8828C20.3047 15.2734 18.9375 16.3359 17.2969 17.0703C15.6719 17.7891 14.0078 18.1484 12.3047 18.1484C11.6328 18.1484 11.1328 18.1172 10.8047 18.0547V17.2344C11.9922 17.2344 13.0859 17.0781 14.0859 16.7656C15.1016 16.4531 16 15.9844 16.7812 15.3594C17.5781 14.7344 18.1953 13.9141 18.6328 12.8984C19.0859 11.8672 19.3125 10.6875 19.3125 9.35938C19.3125 7.21875 18.7734 5.52344 17.6953 4.27344C16.6172 3.02344 14.9297 2.39844 12.6328 2.39844C10.9453 2.39844 9.46094 2.5 8.17969 2.70312C8.27344 3.17188 8.32031 3.66406 8.32031 4.17969ZM35.6719 3.71094V30.7812C35.6719 32.0469 35.9297 32.9688 36.4453 33.5469C36.9609 34.125 37.9375 34.5469 39.375 34.8125L39.1875 35.375C37.4531 35.1406 36.1328 35.0156 35.2266 35C34.3203 34.9844 33.1641 35.1094 31.7578 35.375L31.5938 35.1406C31.9219 34.6875 32.0859 33.8594 32.0859 32.6562V8.02344C32.0859 5.82031 31.8203 4.33594 31.2891 3.57031C30.7578 2.80469 29.6484 2.48438 27.9609 2.60938L27.8672 2.16406C30.4453 1.39844 32.8906 1.01562 35.2031 1.01562C35.5156 1.875 35.6719 2.77344 35.6719 3.71094ZM66.375 35H45.4453C45.1641 34.3438 45.0234 33.5781 45.0234 32.7031C45.6484 32.0312 46.5 30.8672 47.5781 29.2109C48.6719 27.5547 50.0156 25.3516 51.6094 22.6016C53.2188 19.8359 54.5078 17.5938 55.4766 15.875C56.4609 14.1562 57.875 11.6328 59.7188 8.30469C61.5781 4.96094 62.5859 3.15625 62.7422 2.89062L62.4844 2.65625H52.0312C51.1406 2.6875 50.3594 2.82031 49.6875 3.05469C49.0312 3.28906 48.4375 3.65625 47.9062 4.15625C47.3906 4.65625 46.9531 5.1875 46.5938 5.75C46.2344 6.29687 45.8203 7.02344 45.3516 7.92969L44.6953 7.55469L46.4062 1.0625L46.8047 0.734375L67.4766 1.20312L67.7812 1.74219C67.5 2.16406 66.8047 3.3125 65.6953 5.1875C64.7422 6.85937 63.6562 8.67969 62.4375 10.6484C61.2344 12.6484 60.0078 14.7266 58.7578 16.8828L55.0312 23.3281C54.1719 24.8281 52.1016 28.2422 48.8203 33.5703L60.7266 33.0781C61.8672 33.0312 62.8359 32.8984 63.6328 32.6797C64.4453 32.4453 65.1406 32.0859 65.7188 31.6016C66.2969 31.1172 66.7734 30.6094 67.1484 30.0781C67.5234 29.5312 67.9375 28.8047 68.3906 27.8984L69.0703 28.1797L66.7734 34.6719L66.375 35ZM87 2.51562C87.5312 2.1875 88.1406 1.5625 88.8281 0.640625H89.0625L101.977 31.7422C102.555 33.1328 103.734 34.1094 105.516 34.6719V35.0938C104.5 34.9844 103.281 34.9609 101.859 35.0234C100.438 35.1016 99.1797 35.2344 98.0859 35.4219L97.8984 35.1875C98.2109 34.7812 98.2812 34.1016 98.1094 33.1484C97.9531 32.1953 97.4766 30.75 96.6797 28.8125L92.8125 19.1094C88.2188 19.0312 84.4219 19.0469 81.4219 19.1562L76.0078 31.7422C75.6797 32.4609 75.7969 33.0625 76.3594 33.5469C76.9375 34.0312 78.0625 34.4375 79.7344 34.7656L79.6406 35.1875C76.9219 34.9844 74.7031 34.9219 72.9844 35C72.8906 34.9062 72.7891 34.75 72.6797 34.5312L87 2.51562ZM82.0547 17.7734C84.3203 17.8359 87.7109 17.8359 92.2266 17.7734L87.3281 5.53906L82.0547 17.7734Z"
            fill="black"
          />
        </svg>
      </div>
      <div className="flex flex-col md:flex-row justify-between gap-8 md:gap-16">
        {/* Column 1 - Contact Info */}
        <div className="flex flex-col items-end">
          <h3 className="font-bold mb-4 text-[#1E1E1E]  text-right">راه ارتباطی دلتا</h3>
          {contactInfo.map((item, index) => (
            <p
              key={`contact-${index}`}
              className={`text-[#AAAAAA]  text-right ${item.className}`}
            >
              {item.text}
            </p>
          ))}
        </div>

        {/* Column 2 - Customer Services */}
        <div className="flex flex-col items-end">
          <h3 className="font-bold mb-4 text-[#1E1E1E]  text-right">خدمات مشتریان</h3>
          {customerServices.map((item, index) => (
            <p
              key={`service-${index}`}
              className={` text-right text-[#AAAAAA] ${item.className}`}
            >
              {item.text}
            </p>
          ))}
        </div>

        {/* Column 3 - How to Use */}
        <div className="flex flex-col items-end">
          <h3 className="font-bold mb-4 text-right text-[#1E1E1E]">نحوه رزرو اقامتگاه</h3>
          {howToUse.map((item, index) => (
            <p
              key={`howto-${index}`}
              className={` text-right ${item.className} ${
                index == 0 ? "text-[#1E1E1E]" : "text-[#AAAAAA]"
              }`}
            >
              {item.text}
            </p>
          ))}
        </div>

        {/* Column 4 - About */}
        <div className="flex flex-col items-end md:w-auto lg:max-w-md">
          <p className="text-[#1E1E1E] leading-6 text-right mb-5">
            ما در پیزا متعهد به ارائه خدمات متنوع برای راحتی و آسایش شما هستیم،
            از سیستم‌های هوشمند خانگی و رزرو خانه گرفته تا رزرو هتل. با ما،
            زندگی ساده‌تر، هوشمندتر و لذت‌بخش‌تر می‌شود. خدمات ما شامل پلتفرمی
            آسان، راه‌حل‌های شخصی‌سازی‌شده، و پشتیبانی ۲۴/۷ است. به دنیای نوآوری
            و کیفیت خوش آمدید!
          </p>
        </div>
      </div>
      <div className="flex flex-wrap gap-10 justify-end items-center">
        <div className="w-[56px] h-[56px] bg-[#232323] rounded-2xl flex justify-center items-center">
          <Image src={icon1} width={56} height={56} alt="e-namad" />
        </div>
        <div className="w-[56px] h-[56px] bg-[#232323] rounded-2xl flex justify-center items-center">
          <Image src={icon2} width={45} height={45} alt="trust" />
        </div>
        <div className="w-[56px] h-[56px] rounded-2xl flex justify-center items-center">
          <Image src={icon3} width={56} height={56} alt="trust" />
        </div>
      </div>
    </div>
  );
}
